app/controllers/customers_controller.rb

INSERT INTO "customers" ("address", "company", "created_at", "current", "email", "interest", "name", "phone", "profession", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @customer = Customer.new(customer_params)
    @customer.save